Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.DUMisbehavingUpdater
Third party updater '[Name]' has experienced a problem and its action had to be canceled.

Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.DUExcessiveRegeneration
Third party updater '[Name]' has caused an infinite loop and its action had to be canceled.

Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.CannotLoadLink
Can't load Linked File [Name] due to errors. Open it separately to investigate the problem.

Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.CannotAutoUpdate
Coordination Monitor can't update element

Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.ApiDelayedUpdateFailed
Delayed Updating Failed. Please contact the 3rd Party Application vendor.

Autodesk.Revit.DB.BuiltInFailures.DocumentFailures
Failures about DocumentFailures.